Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.command_center_app_secret must be replaced
-/+ resource "kubernetes_secret" "command_center_app_secret" {
      ~ id   = "****************************************" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "command-center-db-secrets"
          ~ namespace        = "command-center" -> "ebo" # forces replacement
          ~ resource_version = "********" -> (known after apply)
          ~ uid              = "************************************" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #446](https://github.com/ebomart/commerce-infrastructure/actions/runs/1880225758)